name: "IntrinsicCNN"
layers {
  name: "data"
  type: MULTI_IMAGE_DATA
  top: "data"
  top: "chrom"
  top: "label"
  multi_prefetch_data_param {
  	  share_random_trafos: true
  	  # input_data_count: 3
      # data - loaded as grayscale image
	  data_transformations {
		random_crop: true
		new_height: 256
		new_width: 256
		crop_size: 227
		crop_first: false
		mirror: true
		scale: 0.00392156862
		is_color: false
		gamma: 2.2
		mean_value: 128
		persistent: true
	  }
      # chromaticity image
	  data_transformations {
		random_crop: true
		new_height: 256
		new_width: 256
		crop_size: 227
		crop_first: false
		mirror: true
		scale: 0.00392156862
		is_color: true
		gamma: 2.2
		mean_value: 128
		mean_value: 128
		mean_value: 128
		persistent: true
	  }
  }
  image_data_param {
    source: "data/iiw-dataset/train-threshold-all.txt"
    batch_size: 20 
  }
  multi_image_data_param {
    use_label: true 
  }
  include: { phase: TRAIN }
}
layers {
  name: "data"
  type: MULTI_IMAGE_DATA
  top: "data"
  top: "chrom"
  top: "label"
  multi_prefetch_data_param {
  	  share_random_trafos: true
  	  # input_data_count: 3
      # data - loaded as grayscale image
	  data_transformations {
		random_crop: true
		new_height: 256
		new_width: 256
		crop_size: 227
		crop_first: false
		mirror: true
		scale: 0.00392156862
		is_color: false
		gamma: 2.2
		mean_value: 128
		persistent: true
	  }
      # chromaticity image
	  data_transformations {
		random_crop: true
		new_height: 256
		new_width: 256
		crop_size: 227
		crop_first: false
		mirror: true
		scale: 0.00392156862
		is_color: true
		gamma: 2.2
		mean_value: 128
		mean_value: 128
		mean_value: 128
		persistent: true
	  }
  }
  image_data_param {
    source: "data/iiw-dataset/test-threshold-all.txt"
    batch_size: 10 
  }
  multi_image_data_param {
    use_label: true 
  }
  include: { phase: TEST }
}
layers {
  name: "concatinput"
  bottom: "data"
  bottom: "chrom"
  top: "concatinput"
  type: CONCAT
  concat_param {
    concat_dim: 1
  }
}
layers {
  name: "conv1"
  type: CONVOLUTION
  bottom: "concatinput"
  top: "conv1"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu1"
  type: RELU
  bottom: "conv1"
  top: "conv1"
}
layers {
  name: "pool1"
  type: POOLING
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  name: "fc2"
  type: INNER_PRODUCT
  bottom: "pool1"
  top: "fc2"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu2"
  type: RELU
  bottom: "fc2"
  top: "fc2"
}
layers {
  name: "fc3"
  type: INNER_PRODUCT
  bottom: "fc2"
  top: "fc3"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu3"
  type: RELU
  bottom: "fc3"
  top: "fc3"
}
layers {
  name: "drop3"
  type: DROPOUT
  bottom: "fc3"
  top: "fc3"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layers {
  name: "fc4"
  type: INNER_PRODUCT
  bottom: "fc3"
  top: "fc4"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu4"
  type: RELU
  bottom: "fc4"
  top: "fc4"
}
layers {
  name: "drop4"
  type: DROPOUT
  bottom: "fc4"
  top: "fc4"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layers {
  name: "fc5"
  type: INNER_PRODUCT
  bottom: "fc4"
  top: "fc5"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "loss"
  type: EUCLIDEAN_LOSS
  bottom: "fc5"
  bottom: "label"
  top: "loss"
}
