name: "IntrinsicCNN"
layers {
  name: "data"
  type: MULTI_IMAGE_DATA
  top: "data"
  top: "label"
  top: "mask"
  multi_prefetch_data_param {
	  label_num: 2
  }
  image_data_param {
    source: "data/mitintrinsic/filtereddata/train.txt"
    batch_size: 5 
    new_height: 100
    new_width: 100
    is_color: true 
    new_label_height: 100
    new_label_width: 100
    label_is_color: false
  }
  transform_param {
    #crop_size: 227
    mirror: false
	  scale: 0.00392156862
	  mean_value: 128
	  mean_value: 128
	  mean_value: 128
  }
  label_transform_param {
	  scale: 0.00392156862
	  mean_value: 128
  }
}
layers {
  name: "conv1"
  type: CONVOLUTION
  bottom: "data"
  top: "conv1"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 1
    kernel_size: 1
    stride: 1
    weight_filler {
  	  type: "positive_unitball"
    }
    bias_filler {
  	  type: "constant"
      value: 0
    }
  }
}
layers {
   name: "imgsave"
   type: IMAGE_OUTPUT
   bottom: "data"
   bottom: "label"
   bottom: "mask"
   bottom: "conv1"
   image_output_param {
      file_name: "debugimgs/img"
   }
}
layers {
  name: "loss"
  type: EUCLIDEAN_LOSS
  bottom: "conv1"
  bottom: "label"
  top: "loss"
}
