name: "IntrinsicCNN"
layers {
  name: "data"
  type: MULTI_IMAGE_DATA
  top: "data"
  top: "label"
  top: "mask"
  multi_prefetch_data_param {
      # data
	  data_transformations {
		new_height: 300
		new_width: 300
		mirror: false
		scale: 0.00392156862
		is_color: true
		mean_value: 128
		mean_value: 128
		mean_value: 128
	  }
      # label
	  data_transformations {
		new_height: 300
		new_width: 300
		crop_size: 298
		scale: 0.00392156862
		is_color: false
		mean_value: 128
	  }
	  # mask
	  data_transformations {
		new_height: 300
		new_width: 300
		crop_size: 298
		scale: 0.00392156862
		is_color: false
	  }
  }
  image_data_param {
    source: "data/mitintrinsic/filtereddata/train.txt"
    batch_size: 5 
    shuffle: true
  }
}
layers {
  name: "conv1"
  type: CONVOLUTION
  bottom: "data"
  top: "conv1"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 1
    kernel_size: 3
    stride: 1
    weight_filler {
  	  type: "constant"
      value: 0.083333
    }
    bias_filler {
  	  type: "constant"
      value: 0
    }
  }
}
layers {
   name: "imgsave"
   type: IMAGE_OUTPUT
   bottom: "data"
   bottom: "label"
   bottom: "conv1"
   image_output_param {
      file_name: "debugimgs/img"
      display: 1000
      transformation {
		  upscale: 255.0
		  mean_to_add: 128.0
      }
      transformation {
		  upscale: 255.0
		  mean_to_add: 128.0
      }
      transformation {
		  upscale: 255.0
		  mean_to_add: 128.0
      }
   }
}
layers {
	name: "silencemask"
	type: SILENCE
	bottom: "mask"
}
layers {
  name: "loss"
  type: EUCLIDEAN_MASKED_LOSS
  bottom: "conv1"
  bottom: "label"
  bottom: "mask"
  top: "loss"
}
