name: "IntrinsicCNN"
layers {
  name: "data"
	type: MULTI_IMAGE_DATA
  top: "data"
  top: "label"
  multi_prefetch_data_param {
      # data
	  data_transformations {
		new_height: 227
		new_width: 533
		crop_size: 227
		random_crop: false
		mirror: false
		scale: 0.00392156862
		is_color: true
		mean_value: 128
		mean_value: 128
		mean_value: 128
	  }
      # label
	  data_transformations {
		new_height: 64
		new_width: 150
		crop_size: 64
		random_crop: false
		scale: 0.00392156862
		is_color: false
		mean_value: 128
	  }
  }
  image_data_param {
    source: "data/mpisintel/train.txt"
    batch_size: 5 
  }
  include: { phase: TRAIN }
}
layers {
  name: "data"
	type: MULTI_IMAGE_DATA
  top: "data"
  top: "label"
  multi_prefetch_data_param {
      # data
	  data_transformations {
		new_height: 227
		new_width: 533
		crop_size: 227
		random_crop: false
		mirror: false
		scale: 0.00392156862
		is_color: true
		mean_value: 128
		mean_value: 128
		mean_value: 128
	  }
      # label
	  data_transformations {
		new_height: 64
		new_width: 150
		crop_size: 64
		random_crop: false
		scale: 0.00392156862
		is_color: false
		mean_value: 128
	  }
  }
  image_data_param {
    source: "data/mpisintel/val.txt"
    batch_size: 5 
  }
  include: { phase: TEST }
}
layers {
  name: "conv1"
  type: CONVOLUTION
  bottom: "data"
  top: "conv1"
  blobs_lr: 0
  blobs_lr: 0
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu1"
  type: RELU
  bottom: "conv1"
  top: "conv1"
}
layers {
  name: "norm1"
  type: LRN
  bottom: "conv1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layers {
  name: "pool1"
  type: POOLING
  bottom: "norm1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layers {
  name: "conv2"
  type: CONVOLUTION
  bottom: "pool1"
  top: "conv2"
  blobs_lr: 0
  blobs_lr: 0
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layers {
  name: "relu2"
  type: RELU
  bottom: "conv2"
  top: "conv2"
}
layers {
  name: "norm2"
  type: LRN
  bottom: "conv2"
  top: "norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layers {
  name: "pool2"
  type: POOLING
  bottom: "norm2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layers {
  name: "conv3"
  type: CONVOLUTION
  bottom: "pool2"
  top: "conv3"
  blobs_lr: 0
  blobs_lr: 0
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu3"
  type: RELU
  bottom: "conv3"
  top: "conv3"
}
layers {
  name: "conv4"
  type: CONVOLUTION
  bottom: "conv3"
  top: "conv4"
  blobs_lr: 0
  blobs_lr: 0
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layers {
  name: "relu4"
  type: RELU
  bottom: "conv4"
  top: "conv4"
}
layers {
  name: "conv5"
  type: CONVOLUTION
  bottom: "conv4"
  top: "conv5"
  blobs_lr: 0
  blobs_lr: 0
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layers {
  name: "relu5"
  type: RELU
  bottom: "conv5"
  top: "conv5"
}
layers {
  name: "pool5"
  type: POOLING
  bottom: "conv5"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layers {
  name: "fc6"
  type: INNER_PRODUCT
  bottom: "pool5"
  top: "fc6"
  blobs_lr: 0
  blobs_lr: 0
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layers {
  name: "relu6"
  type: RELU
  bottom: "fc6"
  top: "fc6"
}
layers {
  name: "drop6"
  type: DROPOUT
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layers {
  name: "fc7"
  type: INNER_PRODUCT
  bottom: "fc6"
  top: "fc7"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
#layers {
#  name: "relu7"
#  type: RELU
#  bottom: "fc7"
#  top: "fc7"
#}
#layers {
#  name: "drop7"
#  type: DROPOUT
#  bottom: "fc7"
#  top: "fc7"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#}
layers {
  name: "reshape"
  type: RESHAPE
  bottom: "fc7"
  top: "reshape"
  reshape_param {
    channels: 1
    height: 64
    width: 64
  }
}
layers {
  name: "loss"
  type: EUCLIDEAN_LOSS
  bottom: "reshape"
  bottom: "label"
  top: "loss"
}
layers {
	name: "imgsave"
	type: IMAGE_OUTPUT
	bottom: "data"
	bottom: "label"
	bottom: "reshape"
	image_output_param {
		file_name: "debugimgs/img"
		display: 5000
		transformation {
			upscale: 255.0
			mean_to_add: 128.0
		}
		transformation {
			upscale: 255.0
			mean_to_add: 128.0
		}
		transformation {
			upscale: 255.0
			mean_to_add: 128.0
		}
	}
}
layers {
	name: "imgsave"
	type: IMAGE_OUTPUT
	bottom: "data"
	bottom: "label"
	bottom: "reshape"
	image_output_param {
		file_name: "debugimgs/testimg"
		display: 1
		transformation {
			upscale: 255.0
			mean_to_add: 128.0
		}
		transformation {
			upscale: 255.0
			mean_to_add: 128.0
		}
		transformation {
			upscale: 255.0
			mean_to_add: 128.0
		}
	}
}
