name: "IntrinsicCNN"
layers {
  name: "data"
	type: MULTI_IMAGE_DATA
  top: "data"
  top: "label"
  multi_prefetch_data_param {
  	  share_random_trafos: true
      # data
	  data_transformations {
		new_height: 227
		new_width: 227
		random_crop: true
		crop_size: 227
		crop_first: true
		mirror: false
		persistent: true
		scale: 0.00392156862
		is_color: true
		mean_value: 128
		mean_value: 128
		mean_value: 128
	  }
      # label
	  data_transformations {
		new_height: 213
		new_width: 213
		random_crop: true
		crop_size: 227
		crop_first: true
		mirror: false
		persistent: true
		scale: 0.00392156862
		is_color: false
		mean_value: 128
	  }
  }
  image_data_param {
    source: "data/mpisintel/train.txt"
    batch_size: 5 
  }
  include: { phase: TRAIN }
}
layers {
  name: "data"
  type: MULTI_IMAGE_DATA
  top: "data"
  top: "label"
  multi_prefetch_data_param {
  	  share_random_trafos: true
      # data
	  data_transformations {
		new_height: 227
		new_width: 227
		random_crop: true
		crop_size: 227
		crop_first: true
		mirror: false
		persistent: true
		scale: 0.00392156862
		is_color: true
		mean_value: 128
		mean_value: 128
		mean_value: 128
	  }
      # label
	  data_transformations {
		new_height: 213
		new_width: 213
		random_crop: true
		crop_size: 227
		crop_first: true
		mirror: false
		persistent: true
		scale: 0.00392156862
		is_color: false
		mean_value: 128
	  }
  }
  image_data_param {
    source: "data/mpisintel/val.txt"
    batch_size: 5 
  }
  include: { phase: TEST }
}
layers {
  name: "conv1"
  type: CONVOLUTION
  bottom: "data"
  top: "conv1"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 16
    kernel_size: 9
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu1"
  type: RELU
  bottom: "conv1"
  top: "conv1"
}
layers {
  name: "norm1"
  type: LRN
  bottom: "conv1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layers {
  name: "conv2"
  type: CONVOLUTION
  bottom: "norm1"
  top: "conv2"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layers {
  name: "relu2"
  type: RELU
  bottom: "conv2"
  top: "conv2"
}
layers {
  name: "norm2"
  type: LRN
  bottom: "conv2"
  top: "norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layers {
  name: "conv3"
  type: CONVOLUTION
  bottom: "norm2"
  top: "conv3"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 1 
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layers {
  name: "loss"
  type: EUCLIDEAN_LOSS
  bottom: "conv3"
  bottom: "label"
  top: "loss"
}
layers {
	name: "imgsave"
	type: IMAGE_OUTPUT
	bottom: "data"
	bottom: "label"
	bottom: "conv3"
	image_output_param {
		file_name: "debugimgs/img"
		display: 5000
		transformation {
			upscale: 255.0
			mean_to_add: 128.0
		}
		transformation {
			upscale: 255.0
			mean_to_add: 128.0
		}
		transformation {
			upscale: 255.0
			mean_to_add: 128.0
		}
	}
    include: { phase: TRAIN }
}
layers {
	name: "imgsave"
	type: IMAGE_OUTPUT
	bottom: "data"
	bottom: "label"
	bottom: "conv3"
	image_output_param {
		file_name: "debugimgs/testimg"
		display: 1
		transformation {
			upscale: 255.0
			mean_to_add: 128.0
		}
		transformation {
			upscale: 255.0
			mean_to_add: 128.0
		}
		transformation {
			upscale: 255.0
			mean_to_add: 128.0
		}
	}
    include: { phase: TEST }
}
